Output from `terraform plan`
```
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "dps-mj-and-ma"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ERROR"
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = true
        }
    }

  # module.replay-pipeline["dps-alerts"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-dps-dps-alerts-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "dps-alerts"
          + "Jira"           = "DPR2-1857"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-dps-dps-alerts-preproduction"
        }
      + tags_all          = {
          + "Domain"         = "dps-alerts"
          + "Jira"           = "DPR2-1857"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-dps-dps-alerts-preproduction"
        }
    }

  # module.replay-pipeline["dps-alerts"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-dps-dps-alerts-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "dps-alerts"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "dps-alerts"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ERROR"
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = true
        }
    }

  # module.replay-pipeline["dps-basm"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-dps-dps-basm-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "dps-basm"
          + "Jira"           = "DPR2-1857"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-dps-dps-basm-preproduction"
        }
      + tags_all          = {
          + "Domain"         = "dps-basm"
          + "Jira"           = "DPR2-1857"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-dps-dps-basm-preproduction"
        }
    }

  # module.replay-pipeline["dps-basm"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-dps-dps-basm-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "dps-basm"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "dps-basm"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ERROR"
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = true
        }
    }

  # module.replay-pipeline["dps-mj-and-ma"].module.replay_pipeline.aws_cloudwatch_log_group.step-function-log-group[0] will be created
  + resource "aws_cloudwatch_log_group" "step-function-log-group" {
      + arn               = (known after apply)
      + id                = (known after apply)
      + log_group_class   = (known after apply)
      + name              = "/aws/vendedlogs/states/log-group-dpr-replay-pipeline-dps-dps-mj-and-ma-preproduction"
      + name_prefix       = (known after apply)
      + retention_in_days = 7
      + skip_destroy      = false
      + tags              = {
          + "Domain"         = "dps-mj-and-ma"
          + "Jira"           = "DPR2-1857"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-dps-dps-mj-and-ma-preproduction"
        }
      + tags_all          = {
          + "Domain"         = "dps-mj-and-ma"
          + "Jira"           = "DPR2-1857"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
          + "name"           = "log-group-dpr-replay-pipeline-dps-dps-mj-and-ma-preproduction"
        }
    }

  # module.replay-pipeline["dps-mj-and-ma"].module.replay_pipeline.aws_sfn_state_machine.data_ingestion_step_function[0] will be created
  + resource "aws_sfn_state_machine" "data_ingestion_step_function" {
      + arn                       = (known after apply)
      + creation_date             = (known after apply)
      + definition                = (known after apply)
      + description               = (known after apply)
      + id                        = (known after apply)
      + name                      = "dpr-replay-pipeline-dps-dps-mj-and-ma-preproduction"
      + name_prefix               = (known after apply)
      + publish                   = false
      + revision_id               = (known after apply)
      + role_arn                  = "arn:aws:iam::972272129531:role/dpr-step-function-execution-role"
      + state_machine_version_arn = (known after apply)
      + status                    = (known after apply)
      + tags                      = {
          + "Domain"         = "dps-mj-and-ma"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + tags_all                  = {
          + "Domain"         = "dps-mj-and-ma"
          + "Jira"           = "main"
          + "Resource_Type"  = "Step Function"
          + "Service_Bundle" = "true"
        }
      + type                      = "STANDARD"
      + version_description       = (known after apply)

      + encryption_configuration (known after apply)

      + logging_configuration {
          + include_execution_data = true
          + level                  = "ERROR"
          + log_destination        = (known after apply)
        }

      + tracing_configuration {
          + enabled = true
        }
    }

  # module.setup-dms-endpoints["dps-alerts"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be created
  + resource "aws_dms_endpoint" "dms-s3-target-source" {
      + certificate_arn             = (known after apply)
      + database_name               = (sensitive value)
      + endpoint_arn                = (known after apply)
      + endpoint_id                 = "dpr-dms-dps-alerts-pgres-source-endpoint"
      + endpoint_type               = "source"
      + engine_name                 = "postgres"
      + extra_connection_attributes = (sensitive value)
      + id                          = (known after apply)
      + kms_key_arn                 = (known after apply)
      + password                    = (sensitive value)
      + port                        = (sensitive value)
      + server_name                 = (sensitive value)
      + ssl_mode                    = "require"
      + tags                        = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                    = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + username                    = (sensitive value)

      + postgres_settings {
          + fail_tasks_on_lob_truncation = true
          + heartbeat_enable             = true
          + heartbeat_frequency          = 5
          + map_boolean_as_boolean       = true
        }

      + redshift_settings (known after apply)
    }

  # module.setup-dms-endpoints["dps-alerts"].module.dms_endpoints.aws_dms_s3_endpoint.dms-s3-target-endpoint[0] will be created
  + resource "aws_dms_s3_endpoint" "dms-s3-target-endpoint" {
      + add_column_name                             = false
      + bucket_name                                 = "dpr-raw-zone-preproduction"
      + cdc_inserts_and_updates                     = false
      + cdc_inserts_only                            = false
      + cdc_max_batch_interval                      = 10
      + cdc_path                                    = "cdc"
      + certificate_arn                             = (known after apply)
      + compression_type                            = "NONE"
      + csv_delimiter                               = ","
      + csv_row_delimiter                           = "\\n"
      + data_format                                 = "parquet"
      + date_partition_enabled                      = false
      + enable_statistics                           = true
      + endpoint_arn                                = (known after apply)
      + endpoint_id                                 = "dpr-dms-dps-alerts-s3-target-endpoint"
      + endpoint_type                               = "target"
      + engine_display_name                         = (known after apply)
      + external_id                                 = (known after apply)
      + glue_catalog_generation                     = false
      + id                                          = (known after apply)
      + include_op_for_full_load                    = true
      + kms_key_arn                                 = (known after apply)
      + max_file_size                               = 120000
      + parquet_timestamp_in_millisecond            = false
      + preserve_transactions                       = false
      + rfc_4180                                    = true
      + service_access_role_arn                     = (known after apply)
      + ssl_mode                                    = (known after apply)
      + status                                      = (known after apply)
      + tags                                        = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                                    = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + timestamp_column_name                       = "_timestamp"
      + use_csv_no_sup_value                        = false
      + use_task_start_time_for_full_load_timestamp = false
    }

  # module.setup-dms-endpoints["dps-alerts"].module.dms_endpoints.aws_iam_policy.dms-operator-s3-policy[0] will be created
  + resource "aws_iam_policy" "dms-operator-s3-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dpr-dms-dps-alerts-operator-s3-target-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:*",
                          + "cloudwatch:*",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcs",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:*Object*",
                          + "s3:PutObjectTagging",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3::*:dpr-*/*",
                          + "arn:aws:s3::*:dpr-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:ListAccessPoints",
                          + "s3:ListJobs",
                          + "s3:ListObjects",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.setup-dms-endpoints["dps-alerts"].module.dms_endpoints.aws_iam_policy.dms-s3-target-policy[0] will be created
  + resource "aws_iam_policy" "dms-s3-target-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dpr-dms-dps-alerts-s3-target-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                          + "kms:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.setup-dms-endpoints["dps-alerts"].module.dms_endpoints.aws_iam_role.dms-operator-s3-target-role[0] will be created
  + resource "aws_iam_role" "dms-operator-s3-target-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-dps-alerts-operator-s3-target-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.setup-dms-endpoints["dps-alerts"].module.dms_endpoints.aws_iam_role.dms-s3-role[0] will be created
  + resource "aws_iam_role" "dms-s3-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-dps-alerts-s3-endpoint-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.setup-dms-endpoints["dps-alerts"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-operator-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-operator-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-dps-alerts-operator-s3-target-role"
    }

  # module.setup-dms-endpoints["dps-alerts"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-dps-alerts-s3-endpoint-role"
    }

  # module.setup-dms-endpoints["dps-basm"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be created
  + resource "aws_dms_endpoint" "dms-s3-target-source" {
      + certificate_arn             = (known after apply)
      + database_name               = (sensitive value)
      + endpoint_arn                = (known after apply)
      + endpoint_id                 = "dpr-dms-dps-basm-pgres-source-endpoint"
      + endpoint_type               = "source"
      + engine_name                 = "postgres"
      + extra_connection_attributes = (sensitive value)
      + id                          = (known after apply)
      + kms_key_arn                 = (known after apply)
      + password                    = (sensitive value)
      + port                        = (sensitive value)
      + server_name                 = (sensitive value)
      + ssl_mode                    = "none"
      + tags                        = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                    = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + username                    = (sensitive value)

      + postgres_settings {
          + fail_tasks_on_lob_truncation = true
          + heartbeat_enable             = true
          + heartbeat_frequency          = 5
          + map_boolean_as_boolean       = true
        }

      + redshift_settings (known after apply)
    }

  # module.setup-dms-endpoints["dps-basm"].module.dms_endpoints.aws_dms_s3_endpoint.dms-s3-target-endpoint[0] will be created
  + resource "aws_dms_s3_endpoint" "dms-s3-target-endpoint" {
      + add_column_name                             = false
      + bucket_name                                 = "dpr-raw-zone-preproduction"
      + cdc_inserts_and_updates                     = false
      + cdc_inserts_only                            = false
      + cdc_max_batch_interval                      = 10
      + cdc_path                                    = "cdc"
      + certificate_arn                             = (known after apply)
      + compression_type                            = "NONE"
      + csv_delimiter                               = ","
      + csv_row_delimiter                           = "\\n"
      + data_format                                 = "parquet"
      + date_partition_enabled                      = false
      + enable_statistics                           = true
      + endpoint_arn                                = (known after apply)
      + endpoint_id                                 = "dpr-dms-dps-basm-s3-target-endpoint"
      + endpoint_type                               = "target"
      + engine_display_name                         = (known after apply)
      + external_id                                 = (known after apply)
      + glue_catalog_generation                     = false
      + id                                          = (known after apply)
      + include_op_for_full_load                    = true
      + kms_key_arn                                 = (known after apply)
      + max_file_size                               = 120000
      + parquet_timestamp_in_millisecond            = false
      + preserve_transactions                       = false
      + rfc_4180                                    = true
      + service_access_role_arn                     = (known after apply)
      + ssl_mode                                    = (known after apply)
      + status                                      = (known after apply)
      + tags                                        = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                                    = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + timestamp_column_name                       = "_timestamp"
      + use_csv_no_sup_value                        = false
      + use_task_start_time_for_full_load_timestamp = false
    }

  # module.setup-dms-endpoints["dps-basm"].module.dms_endpoints.aws_iam_policy.dms-operator-s3-policy[0] will be created
  + resource "aws_iam_policy" "dms-operator-s3-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dpr-dms-dps-basm-operator-s3-target-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:*",
                          + "cloudwatch:*",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcs",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:*Object*",
                          + "s3:PutObjectTagging",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3::*:dpr-*/*",
                          + "arn:aws:s3::*:dpr-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:ListAccessPoints",
                          + "s3:ListJobs",
                          + "s3:ListObjects",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.setup-dms-endpoints["dps-basm"].module.dms_endpoints.aws_iam_policy.dms-s3-target-policy[0] will be created
  + resource "aws_iam_policy" "dms-s3-target-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dpr-dms-dps-basm-s3-target-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                          + "kms:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.setup-dms-endpoints["dps-basm"].module.dms_endpoints.aws_iam_role.dms-operator-s3-target-role[0] will be created
  + resource "aws_iam_role" "dms-operator-s3-target-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-dps-basm-operator-s3-target-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.setup-dms-endpoints["dps-basm"].module.dms_endpoints.aws_iam_role.dms-s3-role[0] will be created
  + resource "aws_iam_role" "dms-s3-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-dps-basm-s3-endpoint-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.setup-dms-endpoints["dps-basm"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-operator-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-operator-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-dps-basm-operator-s3-target-role"
    }

  # module.setup-dms-endpoints["dps-basm"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-dps-basm-s3-endpoint-role"
    }

  # module.setup-dms-endpoints["dps-case-notes"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be updated in-place
  ~ resource "aws_dms_endpoint" "dms-s3-target-source" {
        id                              = "dpr-dms-dps-case-notes-pgres-source-endpoint"
        tags                            = {
            "DMS_Source"     = "dps"
            "Domain"         = "Common"
            "Jira"           = "main"
            "Resource_Type"  = "DMS Source Endpoint"
            "Service_Bundle" = "true"
        }
        # (16 unchanged attributes hidden)

      ~ postgres_settings {
          ~ heartbeat_enable             = true -> false
            # (15 unchanged attributes hidden)
        }
    }

  # module.setup-dms-endpoints["dps-mj-and-ma"].module.dms_endpoints.aws_dms_endpoint.dms-s3-target-source[0] will be created
  + resource "aws_dms_endpoint" "dms-s3-target-source" {
      + certificate_arn             = (known after apply)
      + database_name               = (sensitive value)
      + endpoint_arn                = (known after apply)
      + endpoint_id                 = "dpr-dms-dps-mj-and-ma-pgres-source-endpoint"
      + endpoint_type               = "source"
      + engine_name                 = "postgres"
      + extra_connection_attributes = (sensitive value)
      + id                          = (known after apply)
      + kms_key_arn                 = (known after apply)
      + password                    = (sensitive value)
      + port                        = (sensitive value)
      + server_name                 = (sensitive value)
      + ssl_mode                    = "require"
      + tags                        = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                    = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Source Endpoint"
          + "Service_Bundle" = "true"
        }
      + username                    = (sensitive value)

      + postgres_settings {
          + fail_tasks_on_lob_truncation = true
          + heartbeat_enable             = true
          + heartbeat_frequency          = 5
          + map_boolean_as_boolean       = true
        }

      + redshift_settings (known after apply)
    }

  # module.setup-dms-endpoints["dps-mj-and-ma"].module.dms_endpoints.aws_dms_s3_endpoint.dms-s3-target-endpoint[0] will be created
  + resource "aws_dms_s3_endpoint" "dms-s3-target-endpoint" {
      + add_column_name                             = false
      + bucket_name                                 = "dpr-raw-zone-preproduction"
      + cdc_inserts_and_updates                     = false
      + cdc_inserts_only                            = false
      + cdc_max_batch_interval                      = 10
      + cdc_path                                    = "cdc"
      + certificate_arn                             = (known after apply)
      + compression_type                            = "NONE"
      + csv_delimiter                               = ","
      + csv_row_delimiter                           = "\\n"
      + data_format                                 = "parquet"
      + date_partition_enabled                      = false
      + enable_statistics                           = true
      + endpoint_arn                                = (known after apply)
      + endpoint_id                                 = "dpr-dms-dps-mj-and-ma-s3-target-endpoint"
      + endpoint_type                               = "target"
      + engine_display_name                         = (known after apply)
      + external_id                                 = (known after apply)
      + glue_catalog_generation                     = false
      + id                                          = (known after apply)
      + include_op_for_full_load                    = true
      + kms_key_arn                                 = (known after apply)
      + max_file_size                               = 120000
      + parquet_timestamp_in_millisecond            = false
      + preserve_transactions                       = false
      + rfc_4180                                    = true
      + service_access_role_arn                     = (known after apply)
      + ssl_mode                                    = (known after apply)
      + status                                      = (known after apply)
      + tags                                        = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + tags_all                                    = {
          + "DMS_Source"     = "dps"
          + "Domain"         = "Common"
          + "Jira"           = "main"
          + "Resource_Type"  = "DMS Target Endpoint"
          + "Service_Bundle" = "true"
        }
      + timestamp_column_name                       = "_timestamp"
      + use_csv_no_sup_value                        = false
      + use_task_start_time_for_full_load_timestamp = false
    }

  # module.setup-dms-endpoints["dps-mj-and-ma"].module.dms_endpoints.aws_iam_policy.dms-operator-s3-policy[0] will be created
  + resource "aws_iam_policy" "dms-operator-s3-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dpr-dms-dps-mj-and-ma-operator-s3-target-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "kms:*",
                          + "cloudwatch:*",
                          + "ec2:CreateNetworkInterface",
                          + "ec2:DescribeAvailabilityZones",
                          + "ec2:DescribeInternetGateways",
                          + "ec2:DescribeSecurityGroups",
                          + "ec2:DescribeSubnets",
                          + "ec2:DescribeVpcs",
                          + "ec2:DeleteNetworkInterface",
                          + "ec2:ModifyNetworkInterfaceAttribute",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                  + {
                      + Action   = [
                          + "s3:*Object*",
                          + "s3:PutObjectTagging",
                          + "s3:GetBucketLocation",
                        ]
                      + Effect   = "Allow"
                      + Resource = [
                          + "arn:aws:s3::*:dpr-*/*",
                          + "arn:aws:s3::*:dpr-*",
                        ]
                    },
                  + {
                      + Action   = [
                          + "s3:ListBucket",
                          + "s3:ListAllMyBuckets",
                          + "s3:ListAccessPoints",
                          + "s3:ListJobs",
                          + "s3:ListObjects",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.setup-dms-endpoints["dps-mj-and-ma"].module.dms_endpoints.aws_iam_policy.dms-s3-target-policy[0] will be created
  + resource "aws_iam_policy" "dms-s3-target-policy" {
      + arn              = (known after apply)
      + attachment_count = (known after apply)
      + id               = (known after apply)
      + name             = "dpr-dms-dps-mj-and-ma-s3-target-policy"
      + name_prefix      = (known after apply)
      + path             = "/"
      + policy           = jsonencode(
            {
              + Statement = [
                  + {
                      + Action   = [
                          + "s3:*",
                          + "kms:*",
                        ]
                      + Effect   = "Allow"
                      + Resource = "*"
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + policy_id        = (known after apply)
      + tags_all         = (known after apply)
    }

  # module.setup-dms-endpoints["dps-mj-and-ma"].module.dms_endpoints.aws_iam_role.dms-operator-s3-target-role[0] will be created
  + resource "aws_iam_role" "dms-operator-s3-target-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-dps-mj-and-ma-operator-s3-target-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.setup-dms-endpoints["dps-mj-and-ma"].module.dms_endpoints.aws_iam_role.dms-s3-role[0] will be created
  + resource "aws_iam_role" "dms-s3-role" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Effect    = "Allow"
                      + Principal = {
                          + Service = "dms.amazonaws.com"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "dpr-dms-dps-mj-and-ma-s3-endpoint-role"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)

      + inline_policy (known after apply)
    }

  # module.setup-dms-endpoints["dps-mj-and-ma"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-operator-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-operator-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-dps-mj-and-ma-operator-s3-target-role"
    }

  # module.setup-dms-endpoints["dps-mj-and-ma"].module.dms_endpoints.aws_iam_role_policy_attachment.dms-s3-attachment[0] will be created
  + resource "aws_iam_role_policy_attachment" "dms-s3-attachment" {
      + id         = (known after apply)
      + policy_arn = (known after apply)
      + role       = "dpr-dms-dps-mj-and-ma-s3-endpoint-role"
    }

Plan: 278 to add, 229 to change, 0 to destroy.

```